linear.measurement.postgres.update.original.v.1.27/postgres.op_update.threads_500.mes_16.dat
/usr/bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/postgrenosql-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/checker-qual-3.31.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/postgresql-42.6.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-simple-1.7.13.jar site.ycsb.Client -t -db site.ycsb.postgrenosql.PostgreNoSQLDBClient -P ./workloads/workloada -p recordcount=15585 -threads 500 -P ./postgrenosql/conf/postgrenosql.properties
[OVERALL], RunTime(ms), 991
[OVERALL], Throughput(ops/sec), 1009.0817356205853
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.10090817356205853
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 1
[TOTAL_GC_TIME_%], Time(%), 0.10090817356205853
[READ], Operations, 478
[READ], AverageLatency(us), 226568.2029288703
[READ], MinLatency(us), 165
[READ], MaxLatency(us), 420607
[READ], 95thPercentileLatency(us), 413951
[READ], 99thPercentileLatency(us), 419583
[READ], Return=OK, 478
[READ], Return=NOT_FOUND, 20
[UPDATE-FAILED], Operations, 17
[UPDATE-FAILED], AverageLatency(us), 180928.9411764706
[UPDATE-FAILED], MinLatency(us), 829
[UPDATE-FAILED], MaxLatency(us), 407551
[UPDATE-FAILED], 95thPercentileLatency(us), 365055
[UPDATE-FAILED], 99thPercentileLatency(us), 407551
[CLEANUP], Operations, 500
[CLEANUP], AverageLatency(us), 4.112
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 1940
[CLEANUP], 95thPercentileLatency(us), 1
[CLEANUP], 99thPercentileLatency(us), 1
[READ-FAILED], Operations, 20
[READ-FAILED], AverageLatency(us), 239370.25
[READ-FAILED], MinLatency(us), 235
[READ-FAILED], MaxLatency(us), 419839
[READ-FAILED], 95thPercentileLatency(us), 409343
[READ-FAILED], 99thPercentileLatency(us), 419839
[UPDATE], Operations, 485
[UPDATE], AverageLatency(us), 237778.81855670104
[UPDATE], MinLatency(us), 518
[UPDATE], MaxLatency(us), 421631
[UPDATE], 95thPercentileLatency(us), 416767
[UPDATE], 99thPercentileLatency(us), 420351
[UPDATE], Return=OK, 485
[UPDATE], Return=UNEXPECTED_STATE, 17