linear.measurement.postgres.update.original.v.1.27/postgres.op_update.total_info.threads_100.txt
[UPDATE], 95thPercentileLatency(us), 108543
[UPDATE], AverageLatency(us), 57604.80962343096
[OVERALL], Throughput(ops/sec), 1164.1443538998835
[UPDATE], 95thPercentileLatency(us), 125439
[UPDATE], AverageLatency(us), 54142.99130434782
[OVERALL], Throughput(ops/sec), 1231.527093596059
[UPDATE], 95thPercentileLatency(us), 110207
[UPDATE], AverageLatency(us), 56349.986166007904
[OVERALL], Throughput(ops/sec), 1215.0668286755772
[UPDATE], 95thPercentileLatency(us), 199679
[UPDATE], AverageLatency(us), 69456.98717948717
[OVERALL], Throughput(ops/sec), 1089.3246187363834
[UPDATE], 95thPercentileLatency(us), 100927
[UPDATE], AverageLatency(us), 54745.48846153846
[OVERALL], Throughput(ops/sec), 1257.861635220126
[UPDATE], 95thPercentileLatency(us), 105535
[UPDATE], AverageLatency(us), 54676.23541666667
[OVERALL], Throughput(ops/sec), 1245.3300124533
[UPDATE], 95thPercentileLatency(us), 105471
[UPDATE], AverageLatency(us), 53442.978540772536
[OVERALL], Throughput(ops/sec), 1256.2814070351758
[UPDATE], 95thPercentileLatency(us), 100287
[UPDATE], AverageLatency(us), 50664.64864864865
[OVERALL], Throughput(ops/sec), 1261.034047919294
[UPDATE], 95thPercentileLatency(us), 99519
[UPDATE], AverageLatency(us), 57087.610878661086
[OVERALL], Throughput(ops/sec), 1201.923076923077
[UPDATE], 95thPercentileLatency(us), 203391
[UPDATE], AverageLatency(us), 70107.02024291498
[OVERALL], Throughput(ops/sec), 1019.367991845056
[UPDATE], 95thPercentileLatency(us), 109695
[UPDATE], AverageLatency(us), 59565.55894308943
[OVERALL], Throughput(ops/sec), 1177.8563015312131
[UPDATE], 95thPercentileLatency(us), 96831
[UPDATE], AverageLatency(us), 55243.47083333333
[OVERALL], Throughput(ops/sec), 1193.3174224343675
[UPDATE], 95thPercentileLatency(us), 93951
[UPDATE], AverageLatency(us), 52535.5793814433
[OVERALL], Throughput(ops/sec), 1234.567901234568
[UPDATE], 95thPercentileLatency(us), 101119
[UPDATE], AverageLatency(us), 57092.957264957266
[OVERALL], Throughput(ops/sec), 1199.0407673860911
[UPDATE], 95thPercentileLatency(us), 99775
[UPDATE], AverageLatency(us), 52627.485148514854
[OVERALL], Throughput(ops/sec), 1140.2508551881415
[UPDATE], 95thPercentileLatency(us), 111743
[UPDATE], AverageLatency(us), 59063.814736842105
[OVERALL], Throughput(ops/sec), 1101.3215859030836
[UPDATE], 95thPercentileLatency(us), 111487
[UPDATE], AverageLatency(us), 59747.93280632411
[OVERALL], Throughput(ops/sec), 1156.0693641618498
[UPDATE], 95thPercentileLatency(us), 110143
[UPDATE], AverageLatency(us), 60233.54872881356
[OVERALL], Throughput(ops/sec), 1127.3957158962796
[UPDATE], 95thPercentileLatency(us), 103615
[UPDATE], AverageLatency(us), 54741.5939524838
[OVERALL], Throughput(ops/sec), 1203.3694344163657
[UPDATE], 95thPercentileLatency(us), 126079
[UPDATE], AverageLatency(us), 61725.652083333334
[OVERALL], Throughput(ops/sec), 1131.2217194570135